ofcases/step/v0/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.0127;

vertices
(
    (    0   1   1) // 0
    (    0   0   1) // 1
    (    8   0   1) // 2
    (   50   0   1) // 3
    (    8   1   1) // 4
    (   50   1   1) // 5
    (   50   9   1) // 6
    (    8   9   1) // 7
    (    0   9   1) // 8

    (    0   1   0) // 9
    (    0   0   0) // 10
    (    8   0   0) // 11
    (   50   0   0) // 12
    (    8   1   0) // 13
    (   50   1   0) // 14
    (   50   9   0) // 15
    (    8   9   0) // 16
    (    0   9   0) // 17
);


ySpacing ( (0.3 0.47 250) (0.4 0.06 1) (0.3 0.47 0.004) );
ySpacing2 ( (0.75 0.3 1) (0.25 0.7 0.004) );
yWall ( (0.5 0.5 100) (0.5 0.5 0.03) );

yLower1 ( (0.4 0.7 50) (0.6 0.3 1) );
yLower2 ( (1 1 50) );

// yUpper1 ( (0.1 0.15 2) (0.65 0.35 4) (0.25 0.5 0.005) );
yUpper1 ( (0.1 0.2 2) (0.65 0.35 5) (0.25 0.45 0.005) );

blocks
(
    // Coarse

    // Block 2
    hex (10 11 13 9 1 2 4 0)
    (97 48 1)
    simpleGrading (1 1 1)
    // edgeGrading (1 1 1 1   $yWall  $yLower1 $yLower1 $yWall  1 1 1 1)

    // Block 3
    hex (11 12 14 13 2 3 5 4)
    (33 48 1)
    simpleGrading (1 1 1)
    // simpleGrading (100 1 1)
    // edgeGrading (80 80 80 80    $yLower1 $yLower2 $yLower2  $yLower1  1 1 1 1)

    // Block 4
    hex (9 13 16 17 0 4 7 8)
    (97 65 1)
    simpleGrading (1 1 1)
    // simpleGrading (1 $ySpacing 1)
    // edgeGrading (1 1 1 1   $ySpacing $yUpper1 $yUpper1 $ySpacing  1 1 1 1)

    // Block 5
    hex (13 14 15 16 4 5 6 7)
    (33 65 1)
    simpleGrading (1 1 1)
    // simpleGrading (100 $ySpacing 1)
    // edgeGrading (80 80 80 80   $yUpper1 $ySpacing2 $ySpacing2 $yUpper1  1 1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (9 0 8 17)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (12 14 5 3)
            (14 15 6 5)
        );
    }
    upperWall
    {
        type wall;
        faces
        (
            (17 8 7 16)
            (16 7 6 15)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (9 0 1 10)
            (10 11 2 1)
            (11 12 3 2)
        );
    }
    front
    {
        type empty;
        faces
        (
            (1 2 4 0)
            (2 3 5 4)
            (0 4 7 8)
            (4 5 6 7)
        );
    }
    back
    {
        type empty;
        faces
        (
            (10 9 13 11)
            (11 13 14 12)
            (9 17 16 13)
            (13 16 15 14)
        );
    }
);


// ************************************************************************* //
